# LinkLoadContent Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkLoadContent Properties
LinkLoadContent Class See Also
---
The LinkLoadContent type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ExternalResourceLoadContent.) |
| LoadStatus | A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.  (Inherited from ExternalResourceLoadContent.) |
| Version | The version of the external data that the server is providing in this object.  (Inherited from ExternalResourceLoadContent.) |

# See Also
LinkLoadContent Class
Autodesk.Revit.DB Namespace